{
    "version": "https://jsonfeed.org/version/1",
    "title": "Spencer Sharp",
    "feed_url": "undefined/rss/feed.json",
    "description": "Your blog description",
    "icon": "undefined/favicon.ico",
    "author": {
        "name": "Spencer Sharp"
    },
    "items": [
        {
            "id": "undefined/articles/start-over",
            "content_html": "",
            "url": "undefined/articles/start-over",
            "title": "Start Over - A New Beginning",
            "summary": "Ongoing",
            "date_modified": "2022-12-24T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        },
        {
            "id": "undefined/articles/vinzvinci-life",
            "content_html": "",
            "url": "undefined/articles/vinzvinci-life",
            "title": "My Life as a Community / Company Volunteer",
            "summary": "Ongoing",
            "date_modified": "2022-12-23T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        },
        {
            "id": "undefined/articles/personal-branding",
            "content_html": "<img alt=\"\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fpersonal-branding-image.0a606b6e.webp&amp;w=1080&amp;q=75 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fpersonal-branding-image.0a606b6e.webp&amp;w=2048&amp;q=75 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fpersonal-branding-image.0a606b6e.webp&amp;w=2048&amp;q=75\" width=\"1000\" height=\"420\" decoding=\"async\" data-nimg=\"1\" loading=\"lazy\" style=\"color:transparent\"/>\n<p>My room is just less average than the rest, I don&#x27;t have a cool background or dazzling furniture for you to see behind me as other people have, lols, but the SWAG helps brighten and fill the gaps in my empty room. In the same way this is how my personal brand helped me to get a job and still receive job offers from other companies.</p>\n<p>P.S\nI&#x27;m still going to improve and customize my place soon and put the SWAG in the right place.</p>\n<p>Before we start, I want to introduce myself :)</p>\n<h3>About me</h3>\n<p>I&#x27;m Vincent Villafuerte also known as vinzvinci. I&#x27;m currently in my 3rd-year of college and taking a Bachelor of Science in Information Systems. I&#x27;m passionate about community development and content writing. I created my GitHub account on October 19, 2020, because of Hacktoberfest.</p>\n<h4>Current roles:</h4>\n<ul>\n<li>Microsoft Learn Student Ambassador (Batch - January 2021)</li>\n<li>1st GitHub Campus Expert in the Philippines (Batch - February 2021)</li>\n<li>Developer Relations Intern at <a href=\"http://devprotocol.xyz/\">Dev Protocol</a> (Started - June 2021)</li>\n<li>I founded <a href=\"https://github.com/SurPathHub/\">SurPath Hub</a> &amp; <a href=\"https://github.com/WebXDAO\">WebX DAO</a> - Open Source Community</li>\n</ul>\n<p>If you&#x27;re asking how did I get those roles so fast, I also don&#x27;t know why :smile:, but maybe the tips I give below helped me on my journey in tech :rocket:</p>\n<h3>Get started</h3>\n<p>My personal branding helped me achieve my goals. I want to share with y&#x27;all the tips that helped me.</p>\n<p>Personal branding isn&#x27;t just for someone who owns a business and who puts their product on the market. It can also be for you; you may want to be known as an aspiring blockchain developer or an aspiring software engineer, or a student developer who likes to lead their peers. It&#x27;s how you promote yourself in different social media and this may be the reason that you get hired, because of your personal branding.</p>\n<p>Your personal branding is concrete proof to showcase your interest and expertise. It is how you demonstrate to your employer that you are valuable and make them feel that you are the one who they&#x27;re looking for. Some folks don&#x27;t really realize how important their personal brand is and this is one of the reasons why it is hard for them to get a job even they have great skills.</p>\n<p>Don&#x27;t worry if you are new, it is not too late to get started because</p>\n<h3>I am giving you 8 tips to build your personal brand and make friends in the tech industry</h3>\n<h4>1. Use your real name, same username, and same profile picture to all of your social media</h4>\n<blockquote>\n<p>You don&#x27;t need to use all of the social media you have, but you can use your <a href=\"https://www.linkedin.com/in/vinzvinci/\">LinkedIn</a>, <a href=\"https://twitter.com/vinzvinci\">Twitter</a> and your <a href=\"https://github.com/vinzvinci\">GitHub profile</a> only like I did.</p>\n</blockquote>\n<h4>2. Build your own unique GitHub profile</h4>\n<blockquote>\n<p>Introduce yourself, showcase your interests, what fields are you passionate about, and let your personal project speak for your skills.</p>\n</blockquote>\n<blockquote>\n<p>If you need help, you can visit this <a href=\"https://github.com/SurPathHub/github-profile-ph#github-profiles\">repository</a> to get some ideas.</p>\n</blockquote>\n<h4>3. Contribute to open source</h4>\n<blockquote>\n<p>Well, you don&#x27;t need to make a lot of projects but contributing to open source is also one of the best ways to make your GitHub profile look more interesting.</p>\n</blockquote>\n<h4>4. Join Open Source Community</h4>\n<blockquote>\n<p>If you want a friend to guide you on your open source journey, you can join an open source community like <a href=\"eddiehub.org\">EddieHub</a> or a hackathon community like <a href=\"https://mlh.io/\">MLH</a>. These communities will help you to accelerate your learning. There&#x27;s a lot of communities out there, you can search or find them on Twitter.</p>\n</blockquote>\n<blockquote>\n<p>EddieHub Community is where I started and the community has done so many things for my life.</p>\n</blockquote>\n<blockquote>\n<p>Once you join to the community, one thing to keep in mind is to follow community rules.</p>\n</blockquote>\n<h4>5. Collaboration</h4>\n<blockquote>\n<p>At <a href=\"https://www.eddiehub.org/\">EddieHub Community</a>, we believe <strong>collaboration</strong> first, <strong>code</strong> second. This is very accurate, because if you don&#x27;t have collaboration skills then it will be hard for your teammate to collaborate with you and know you as well. So try to overcome your shyness, don&#x27;t worry everyone is friendly. If you are worried about failing, it is okay because it is part of your journey.</p>\n</blockquote>\n<h4>6. Join Hackathon</h4>\n<blockquote>\n<p>Here you will meet a lot of great folks. Joining a hackathon is also one of the best ways to accelerate your learning, make connections, and collaborating with other people. Don&#x27;t waste the opportunity to introduce yourself there because you can&#x27;t expect the opportunity.</p>\n</blockquote>\n<h4>7. Create your own Portfolio</h4>\n<blockquote>\n<p>Here you can also showcase everything you love. If you lack the experience to code your portfolio, you can learn first and do it next time. Let your GitHub profile showcase your interest and the work you do while you don&#x27;t have a portfolio. Some employers are looking at the GitHub profile :wink:</p>\n</blockquote>\n<h4>8. Build your resume</h4>\n<blockquote>\n<p>Of course, if you are applying for a job, you need a resume, so better to give your best shot at writing this. If you want people to review your resume, you can make an issue on the <a href=\"https://github.com/EddieHubCommunity/support/issues\">EddieHub support repository</a> or if you just want to have an insight from them, you can read their feedback <a href=\"https://github.com/EddieHubCommunity/support/issues?q=is%3Aissue+is%3Aclosed+resume+label%3A%22live+stream+review%22\">here</a>.</p>\n</blockquote>\n<p>Personal branding will help you stand out from the crowd and get your dream job at an early age.</p>\n<p>I hope this will help you achieve your goal. Never stop dreaming, never stop learning, never stop the collaboration, and soon you will achieve your dream job. Good luck with your career and take care of your health!</p>\n<p>Main article at <a href=\"https://dev.to/vinzvinci/helping-you-to-build-your-personal-brand-in-tech-35df\">dev.to</a></p>",
            "url": "undefined/articles/personal-branding",
            "title": "Helping you to build your Personal Branding",
            "summary": "Your personal branding is concrete proof to showcase your interest and expertise. Join me as I am sharing my experience on how I built my Personal Branding in Tech.",
            "date_modified": "2021-09-14T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        }
    ]
}